# MetallicpaintPearl Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MetallicPaint..::..MetallicpaintPearl Property
MetallicPaint Class See Also
---
The property labeled "Pearl" from the "MetallicPaint" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetallicpaintPearl { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetallicpaintPearl As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetallicpaintPearl {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintPearlType".
# See Also
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace